In [4]:
from sqlalchemy import create_engine
from pathlib import Path

import pandas as pd
import numpy as np

pd.options.display.float_format = '{:,.2f}'.format

db_file = 'comisiones.db'
db_file_path_str = str(Path().cwd().parent.parent.joinpath(f'data/{db_file}'))

engine = create_engine(f'sqlite:///{db_file_path_str}')

In [5]:
with engine.connect() as conn, conn.begin():  
    ventas_enero = pd.read_sql_table('ventas_enero', conn)
    ventas_febrero = pd.read_sql_table('ventas_febrero', conn)
    ventas_marzo = pd.read_sql_table('ventas_marzo', conn)
    ventas_abril = pd.read_sql_table('ventas_abril', conn)
    ventas_mayo = pd.read_sql_table('ventas_mayo', conn)
    ventas_año = pd.read_sql_table('ventas_año', conn)

engine.dispose()

In [8]:
ventas = ventas_enero

In [13]:
ventas[['name', 'quantity', 'price_subtotal']].groupby('name', dropna=False).sum()

                   quantity  price_subtotal
name
F1-CC/2024/00001      20.00          129.40
F1-CC/2024/00002       7.00          390.02
F1-CC/2024/00003      40.00          299.00
F1-CC/2024/00004      12.00          126.44
F1-CC/2024/00008       5.00          573.85
...                     ...             ...
RF1-CC/2024/00014     -4.00         -599.56
RF1-CC/2024/00015     -2.00         -114.34
RF2-CC/2024/00001    -12.00       -2,332.77
RF2-CC/2024/00002    -38.00         -972.92
RF2-CC/2024/00007     -7.00         -133.07

[4049 rows x 2 columns]

In [16]:
facturas_mes_vendedora = ventas.loc[ventas['salesperson_name'] == 'Mayra Angelica Parada Manjarrez', ['salesperson_name', 'price_subtotal']].groupby(by='salesperson_name').sum()
facturas_mes_vendedora

                                 price_subtotal
salesperson_name
Mayra Angelica Parada Manjarrez    1,442,589.41

In [8]:
# facturas_mes_vendedora.to_excel('Facturas_mes_vendedora.xlsx')

## Algo de <span style="color: steelblue">BI</span>

In [18]:
ventas[['business_model', 'quantity', 'price_subtotal']].groupby('business_model', dropna=False).sum()

                 quantity  price_subtotal
business_model
CE              63,375.17    3,699,932.44
Piso           100,171.49    2,190,097.03
NaN             10,245.10      162,559.07

In [19]:
ventas[['sale_team_description', 'quantity', 'price_subtotal']].groupby('sale_team_description', dropna=False).sum()

                       quantity  price_subtotal
sale_team_description
A1 CSL                33,827.39      671,775.79
A2 SJC                66,344.10    1,518,321.24
CE A1                 40,673.17    2,597,777.03
CE A2                 22,702.00    1,102,155.41
NaN                   10,245.10      162,559.07

In [20]:
ventas[['warehouse', 'quantity', 'price_subtotal']].groupby('warehouse', dropna=False).sum()

           quantity  price_subtotal
warehouse
A1        74,500.56    3,269,552.82
A2        89,046.10    2,620,476.65
NaN       10,245.10      162,559.07

In [21]:
total_enero = pd.DataFrame(ventas_enero['price_subtotal'].sum(), columns=['Total de Venta'], index=[0])
total_febrero = pd.DataFrame(ventas_febrero['price_subtotal'].sum(), columns=['Total de Venta'], index=[0])
total_marzo = pd.DataFrame(ventas_marzo['price_subtotal'].sum(), columns=['Total de Venta'], index=[0])
total_abril = pd.DataFrame(ventas_abril['price_subtotal'].sum(), columns=['Total de Venta'], index=[0])

In [22]:
print('Enero', total_enero)
print('Febrero', total_febrero)
print('Marzo', total_marzo)
print('Abril', total_abril)

print('Total', total_enero + total_febrero + total_marzo + total_abril)

Enero    Total de Venta
0    6,052,588.54
Febrero    Total de Venta
0    5,824,480.79
Marzo    Total de Venta
0    7,041,388.79
Abril    Total de Venta
0    6,732,557.43
Total    Total de Venta
0   25,651,015.55

In [27]:
ventas.loc[ventas['sale_team_description'].isna(), 'salesperson_id'].unique()

array([219, 234], dtype=int64)